bench/results/20260917T202348Z-cursor/raw/heavy/api/csharp/round1/mix-r2000.wrk2.txt
Running 10s test @ http://127.0.0.1:18401
  1 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.39ms    0.98ms  24.67ms   88.35%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.29ms
 75.000%    1.75ms
 90.000%    2.22ms
 99.000%    3.53ms
 99.900%   15.17ms
 99.990%   24.46ms
 99.999%   24.69ms
100.000%   24.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.148     0.000000            1         1.00
       0.556     0.100000         1888         1.11
       0.776     0.200000         3774         1.25
       0.946     0.300000         5663         1.43
       1.121     0.400000         7545         1.67
       1.289     0.500000         9427         2.00
       1.372     0.550000        10367         2.22
       1.459     0.600000        11311         2.50
       1.547     0.650000        12253         2.86
       1.643     0.700000        13193         3.33
       1.754     0.750000        14142         4.00
       1.810     0.775000        14607         4.44
       1.872     0.800000        15079         5.00
       1.944     0.825000        15551         5.71
       2.025     0.850000        16028         6.67
       2.111     0.875000        16495         8.00
       2.165     0.887500        16730         8.89
       2.219     0.900000        16964        10.00
       2.283     0.912500        17198        11.43
       2.351     0.925000        17438        13.33
       2.437     0.937500        17672        16.00
       2.479     0.943750        17790        17.78
       2.531     0.950000        17908        20.00
       2.595     0.956250        18025        22.86
       2.671     0.962500        18144        26.67
       2.765     0.968750        18260        32.00
       2.821     0.971875        18318        35.56
       2.877     0.975000        18376        40.00
       2.953     0.978125        18435        45.71
       3.053     0.981250        18496        53.33
       3.147     0.984375        18553        64.00
       3.221     0.985938        18582        71.11
       3.319     0.987500        18613        80.00
       3.451     0.989062        18641        91.43
       3.583     0.990625        18671       106.67
       3.827     0.992188        18700       128.00
       3.977     0.992969        18715       142.22
       4.115     0.993750        18730       160.00
       4.443     0.994531        18744       182.86
       4.695     0.995313        18759       213.33
       5.383     0.996094        18774       256.00
       6.139     0.996484        18781       284.44
       6.879     0.996875        18789       320.00
       7.835     0.997266        18796       365.71
       8.231     0.997656        18803       426.67
       8.815     0.998047        18811       512.00
       9.335     0.998242        18814       568.89
      10.071     0.998437        18818       640.00
      11.863     0.998633        18822       731.43
      12.935     0.998828        18825       853.33
      15.695     0.999023        18829      1024.00
      16.343     0.999121        18831      1137.78
      17.167     0.999219        18833      1280.00
      18.943     0.999316        18835      1462.86
      19.343     0.999414        18836      1706.67
      20.383     0.999512        18838      2048.00
      21.039     0.999561        18839      2275.56
      21.759     0.999609        18840      2560.00
      22.047     0.999658        18841      2925.71
      22.367     0.999707        18842      3413.33
      22.863     0.999756        18843      4096.00
      22.863     0.999780        18843      4551.11
      24.367     0.999805        18844      5120.00
      24.367     0.999829        18844      5851.43
      24.463     0.999854        18845      6826.67
      24.463     0.999878        18845      8192.00
      24.463     0.999890        18845      9102.22
      24.527     0.999902        18846     10240.00
      24.527     0.999915        18846     11702.86
      24.527     0.999927        18846     13653.33
      24.527     0.999939        18846     16384.00
      24.527     0.999945        18846     18204.44
      24.687     0.999951        18847     20480.00
      24.687     1.000000        18847          inf
#[Mean    =        1.391, StdDeviation   =        0.983]
#[Max     =       24.672, Total count    =        18847]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18848 requests in 10.00s, 10.53MB read
Requests/sec:   1884.80
Transfer/sec:      1.05MB
MIX_ERRORS connect=0 read=0 write=0 status=0 timeout=0